ESTA ES LA PRUEBA TECNICA DE SQL

PARA EJECTURA COMANDOS DE SQL CORRA EL SIGUIENTE CODIGO

In [1]:
%load_ext sql
%config SqlMagic.feedback=False
%config SqlMagic.autopandas=True
%config SqlMagic.short_errors=False

In [2]:
%sql sqlite://

In [5]:
 #Specifying the path of the database
%sql sqlite:///chinook/chinook.db

![alternative text](chinook/chinook_model.jpg)

PREGUNTA 1: Listar los generos mas vendidos de la tienda

In [7]:
%%sql

   sqlite://
 * sqlite:///chinook/chinook.db

                  Name  count(quantity)
0                 Rock              835
1                Latin              386
2                Metal              264
3   Alternative & Punk              244
4                 Jazz               80
5                Blues               61
6             TV Shows               47
7             R&B/Soul               41
8            Classical               41
9               Reggae               30
10               Drama               29
11                 Pop               28
12          Soundtrack               20
13    Sci Fi & Fantasy               20
14         Hip Hop/Rap               17
15          Bossa Nova               15
16         Alternative               14
17               World               13
18         Heavy Metal               12
19   Electronica/Dance               12
20      Easy Listening               10
21              Comedy                9
22     Science Fiction                6
23       Rock And Roll                6
24               Opera                0

PREGUNTA 2: LISTAR LA CANTIDAD DE CANCIONES QUE TIENE UN ALBUM POR ARTISTA EL TOP 5 DE LOS ALBUMS QUE TIENEN MAS CANCIONES

In [53]:
%%sql

   sqlite://
 * sqlite:///chinook/chinook.db

            Name           Title  count(t.trackid)
0  Lenny Kravitz   Greatest Hits                57
1  Chico Buarque  Minha Historia                34
2   Eric Clapton       Unplugged                30
3           Lost  Lost, Season 3                26
4           Lost  Lost, Season 1                25

PREGUNTA 3: listar todos los empleados que tuvieron un soporte a usuarios

In [92]:
%%sql

   sqlite://
 * sqlite:///chinook/chinook.db

,LastName,FirstName,Title,LastName,FirstName,Title,count(1)
0,Edwards,Nancy,Sales Manager,Peacock,Jane,Sales Support Agent,21
1,Edwards,Nancy,Sales Manager,Park,Margaret,Sales Support Agent,20
2,Edwards,Nancy,Sales Manager,Johnson,Steve,Sales Support Agent,18

In [ ]:
PREGUNTA 4: REALICE UN RANKING DE TODAS LAS CIUDADES Y PAISES DONDE SE ANALISE EL TOTAL DE VENTAS Y LA CANTIDAD DE UNIDADES VENDIDAS

In [115]:
%%sql

   sqlite://
 * sqlite:///chinook/chinook.db

,country,city,sum_total,sum_quantity,rank_total,rank_quantity
0,USA,Mountain View,4667.06,494,1,1
1,Canada,Montréal,2689.96,304,2,2
2,France,Paris,1722.10,190,3,4
3,Brazil,São José dos Campos,1677.10,190,4,3
4,Germany,Stuttgart,1392.48,152,5,5
5,United Kingdom,London,1003.86,114,6,6
6,Czech Republic,Prague,879.24,76,7,7
7,Portugal,Lisbon,687.24,76,8,8
8,India,Delhi,667.28,74,9,9
9,Hungary,Budapest,446.62,38,10,17
10,Ireland,Dublin,446.62,38,11,18
11,Chile,Santiago,415.62,38,12,14
12,Austria,Vienne,404.62,38,13,12
13,Norway,Oslo,362.62,38,14,21
14,Netherlands,Amsterdam,352.62,38,15,20
15,Finland,Helsinki,350.62,38,16,16
16,Sweden,Stockholm,340.62,38,17,24
17,Argentina,Buenos Aires,334.62,38,18,10
18,Australia,Sidney,334.62,38,19,11
19,Denmark,Copenhagen,334.62,38,20,15
20,Italy,Rome,334.62,38,21,19
21,Belgium,Brussels,334.62,38,22,13
22,Poland,Warsaw,334.62,38,23,22
23,Spain,Madrid,334.62,38,24,23